Repository: yyy1mu/WhatBattery
Catalog: WhatBattery/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld accessories
zh_hans: %lld 个配件

source: %lld%% charging
zh_hans: %lld%%，充电中

source: 7 Days
zh_hans: 7 天

source: 24 Hours
zh_hans: 24 小时

source: 30 Days
zh_hans: 30 天

source: A Bluetooth battery refresh is already running.
zh_hans: 另一个蓝牙电量刷新正在进行。

source: Access Denied
zh_hans: 访问被拒绝

source: Access Granted
zh_hans: 已授权

source: Access Not Requested
zh_hans: 尚未请求权限

source: Allow Bluetooth access to read BLE battery levels.
zh_hans: 请允许蓝牙访问以读取 BLE 电量。

source: Allow Input Monitoring access, then restart the app.
zh_hans: 请允许“输入监控”权限，然后重新启动应用。

source: Another HID request is already waiting for a response.
zh_hans: 已有一个 HID 请求正在等待回应。

source: App Language
zh_hans: 应用语言

source: Apple & Bluetooth
zh_hans: Apple 与蓝牙

source: Apple and Bluetooth devices are up to date.
zh_hans: Apple 与蓝牙设备电量已更新。

source: Battery
zh_hans: 电量

source: Battery history for %@
zh_hans: %@ 的电量历史

source: Battery level
zh_hans: 电池电量

source: Battery Level
zh_hans: 电池电量

source: Bluetooth
zh_hans: 蓝牙

source: Bluetooth Device
zh_hans: 蓝牙设备

source: Check Again
zh_hans: 再次检查

source: Check protected keyboard battery levels
zh_hans: 检查受保护键盘的电量

source: Bluetooth is temporarily unavailable.
zh_hans: 蓝牙暂时不可用。

source: Bluetooth is turned off.
zh_hans: 蓝牙已关闭。

source: Bluetooth LE Device
zh_hans: BLE 设备

source: Bluetooth Low Energy
zh_hans: 低功耗蓝牙

source: Bluetooth Low Energy is not supported on this Mac.
zh_hans: 这台 Mac 不支持低功耗蓝牙。

source: Bluetooth permission is required to read BLE battery levels.
zh_hans: 读取 BLE 电量需要蓝牙权限。

source: Cancel
zh_hans: 取消

source: Case
zh_hans: 充电盒

source: Change
zh_hans: 变化

source: Charging
zh_hans: 充电中

source: Choose a longer time range or wait for a new reading.
zh_hans: 请选择更长的时间范围，或等待新的电量读数。

source: Clear Battery History?
zh_hans: 清除电量历史？

source: Clear History
zh_hans: 清除历史

source: Connected
zh_hans: 已连接

source: Date
zh_hans: 日期

source: Device
zh_hans: 设备

source: Device Rule Settings
zh_hans: 设备规则设置

source: Device Rules
zh_hans: 设备规则

source: Follow System
zh_hans: 跟随系统

source: General
zh_hans: 通用

source: History
zh_hans: 历史

source: History will appear after WhatBattery successfully reads a device battery level.
zh_hans: WhatBattery 成功读取设备电量后，历史记录会显示在这里。

source: Input Monitoring permission is required for this device rule.
zh_hans: 此设备规则需要“输入监控”权限。

source: Input Monitoring permission is required for this device.
zh_hans: 此设备需要“输入监控”权限。

source: Input Monitoring
zh_hans: 输入监控

source: Invalid HID protocol configuration: %@
zh_hans: HID 协议配置无效：%@

source: Language
zh_hans: 语言

source: Last checked
zh_hans: 上次检查

source: Last known battery
zh_hans: 最近电量

source: Lofree and other protected keyboard battery rules require Input Monitoring access. Turn this off to skip those rules and avoid checking permission status.
zh_hans: Lofree 和其他受保护键盘的电量规则需要“输入监控”权限。关闭此选项后，应用会跳过这些规则，也不会检查权限状态。

source: Lofree battery monitoring needs Input Monitoring access.
zh_hans: Lofree 电量监控需要“输入监控”权限。

source: Later
zh_hans: 稍后

source: Latest
zh_hans: 最新

source: Left
zh_hans: 左侧

source: Lowest battery is %@ at %lld percent.
zh_hans: 最低电量设备是 %@，电量为 %lld%%。

source: Maximum
zh_hans: 最高

source: Minimum
zh_hans: 最低

source: No Apple or Bluetooth accessory battery information was found.
zh_hans: 未发现可读取的 Apple 或蓝牙配件电量。

source: No Battery Devices Found
zh_hans: 未发现电池设备

source: No Battery History
zh_hans: 暂无电量历史

source: No Data in This Range
zh_hans: 此时间范围内没有数据

source: No readable peripheral battery is available.
zh_hans: 当前没有可读取的外设电量。

source: No valid device rules were loaded.
zh_hans: 没有加载到有效的设备规则。

source: Not charging
zh_hans: 未充电

source: Not Checked
zh_hans: 未检查

source: OK
zh_hans: 好

source: Open Bluetooth Privacy Settings
zh_hans: 打开蓝牙隐私设置

source: Open Input Monitoring Settings
zh_hans: 打开输入监控设置

source: Open Settings
zh_hans: 打开设置

source: Permission Status
zh_hans: 权限状态

source: Quit WhatBattery
zh_hans: 退出 WhatBattery

source: Reading Apple and Bluetooth battery levels…
zh_hans: 正在读取 Apple 与蓝牙设备电量…

source: Reading battery level…
zh_hans: 正在读取电量…

source: Reading battery levels…
zh_hans: 正在读取电量…

source: Request Access
zh_hans: 请求权限

source: Refresh All
zh_hans: 全部刷新

source: Refresh Bluetooth
zh_hans: 刷新蓝牙设备

source: Reload Rules
zh_hans: 重新加载规则

source: Restart App
zh_hans: 重新启动应用

source: Restart Now
zh_hans: 立即重启

source: Restart the app to apply the selected language everywhere.
zh_hans: 重启应用后，所选语言将应用到所有菜单和状态信息。

source: Restart WhatBattery?
zh_hans: 重启 WhatBattery？

source: Right
zh_hans: 右侧

source: Rule Problems
zh_hans: 规则问题

source: Rules directory
zh_hans: 规则目录

source: Rules files
zh_hans: 规则文件

source: Searching for %@…
zh_hans: 正在查找 %@…

source: Select a point on the chart to inspect its battery level.
zh_hans: 在图表中选择一个点以查看电量。

source: Selected Date
zh_hans: 已选日期

source: Settings
zh_hans: 设置

source: Show Rules Directory
zh_hans: 显示规则目录

source: Simplified Chinese
zh_hans: 简体中文

source: Status
zh_hans: 状态

source: The device did not respond and may be sleeping.
zh_hans: 设备没有回应，可能正在休眠。

source: The device did not respond. Keeping the last battery level.
zh_hans: 设备没有回应；保留上次电量。

source: The device does not expose a supported battery feature.
zh_hans: 设备没有提供受支持的电池功能。

source: The HID device did not respond.
zh_hans: HID 设备没有回应。

source: The HID device returned an invalid battery level: %lld.
zh_hans: HID 设备返回了无效电量：%lld。

source: The HID device returned protocol error 0x%@.
zh_hans: HID 设备返回协议错误 0x%@。

source: The HID device was disconnected.
zh_hans: HID 设备已断开。

source: The HID protocol variable %@ has no value.
zh_hans: HID 协议变量 %@ 没有可用值。

source: The HID response is malformed.
zh_hans: HID 回应格式无效。

source: The matched device does not expose the expected battery feature.
zh_hans: 匹配的设备没有提供规则所需的电池功能。

source: The receiver is connected, but the peripheral is offline.
zh_hans: 接收器已连接，但外设不在线。

source: This permanently deletes battery history for all devices.
zh_hans: 这将永久删除所有设备的电量历史。

source: Time Range
zh_hans: 时间范围

source: Unable to open the HID interface: %@
zh_hans: 无法打开 HID interface：%@

source: Unable to Open the Rules Directory
zh_hans: 无法打开规则目录

source: Unable to send the HID report: %@
zh_hans: 发送 HID 报告失败：%@

source: Unable to start the HID device manager: %@
zh_hans: 无法启动 HID 设备管理器：%@

source: Unknown
zh_hans: 未知

source: Waiting to check Apple and Bluetooth accessories…
zh_hans: 正在等待检查 Apple 与蓝牙配件…
